app/controllers/contacts_controller.rb

  def statistic
    current_navigation :contacts
    @contacts = Contact.all
    @pocetKontaktu = Contact.count
---
SELECT * FROM `contacts`
SELECT count(*) AS count_all FROM `contacts`

  def index
    @contacts = Contact.all
---
SELECT * FROM `contacts`

  def show
    @contact = Contact.find(params[:id])
---
SELECT * FROM `contacts` WHERE (`contacts`.`id` = 1)

  def edit
    @contact = Contact.find(params[:id])
---
SELECT * FROM `contacts` WHERE (`contacts`.`id` = 1)

  def create
    @contact = Contact.new(params[:contact])

    respond_to do |format|
      if @contact.save
---
INSERT INTO `contacts` (`created_at`, `updated_at`, `weight`, `mob_phone`, `last_name`, `height`, `body_type_id`, `age`, `first_name`, `land_line`, `email`) VALUES('2010-06-14 08:22:38', '2010-06-14 08:22:38', 0, '65432345', 'ě+š+ěš', 0, 5, 0, '3232šěšěšíěšáě', '', '')

  def update
    @contact = Contact.find(params[:id])

    respond_to do |format|
      if @contact.update_attributes(params[:contact])
---
SELECT * FROM `contacts` WHERE (`contacts`.`id` = 1)
UPDATE `contacts` SET `first_name` = 'Skočdopodolský', `last_name` = 'František Jonatán', `mob_phone` = '', `land_line` = '', `email` = 'jonatan@koknec.cz', `height` = 180, `weight` = 40, `age` = 34, `body_type_id` = 2, `updated_at` = '2010-06-09 12:37:15' WHERE `id` = 980190963