app/controllers/scripts_controller.rb

	def statistic
    @contacts = Script.all
    @pocetKontaktu = Script.count
---
SELECT * FROM `scripts`
SELECT count(*) AS count_all FROM `scripts`

  def index
    @scripts = Script.find  :all, :order => "name"
---
SELECT * FROM `scripts`

  def show
    @script = Script.find(params[:id])
---
SELECT * FROM `scripts` WHERE (`scripts`.`id` = 1)

  def edit
    @title="Editace skriptu"
  	@script = Script.find(params[:id])
---
SELECT * FROM `scripts` WHERE (`scripts`.`id` = 1)

  def create
    @script = Script.new(params[:script])

    respond_to do |format|
      if @script.save
---
INSERT INTO `scripts` (`name`, `message`, `created_at`, `updated_at`) VALUES('První rozhovor', 'The interview should be conducted in a natural manner, going with the flow – we first ask\r\nabout expectations, then establish an understanding/consensus that the evaluation is not\r\nfocused on the project as a whole, but on one of its segments only – the DP and issues\r\nrelated thereto.\r\nImplementing partners have the opportunity to structure the theme themselves (issues,\r\nproblem areas), nonetheless, they have to be defined clearly enough and the evaluator must\r\nprevent drifting from the theme too far.\r\nComplementary questions have been designed for thematic area 2 (DP content) which will\r\nallow to overcome the “dead-end roads” in the interview.\r\nTo conclude the segment of questions dealing with thematic area 2, complementary\r\nquestions have been designed and may be varied according to the previous flow/content of\r\nthe interview (those that have been answered in the course of the interview will be skipped).\r\nDifficult – structured themes concerning thematic areas 1 and 3 are addressed at the end of\r\nthe interview, for they may require higher level of trust and communication ease, it is\r\nhowever necessary to ensure that this segment of the interview is not conduced under time\r\npressure.\r\n', '2010-06-09 09:53:26', '2010-06-09 09:53:26')

  def update
    @script = Script.find(params[:id])

    respond_to do |format|
      if @script.update_attributes(params[:script])
---
SELECT * FROM `scripts` WHERE (`scripts`.`id` = 2)
UPDATE `scripts` SET `updated_at` = '2010-06-16 11:42:11', `message` = '<div style = \"background-color = \'lime\'\"><b>The interview should be conducted in a natural manner, going with the flow – we first ask\r\nabout expectations, then establish an understanding/consensus that the evaluation is not\r\nfocused on the project as a whole, but on one of its segments only – the DP and issues\r\nrelated thereto.</b><BR/></p>\r\nImplementing partners have the opportunity to structure the theme themselves (issues,\r\nproblem areas), nonetheless, they have to be defined clearly enough and the evaluator must\r\nprevent drifting from the theme too far.<BR/>\r\nComplementary questions have been designed for thematic area 2 (DP content) which will\r\nallow to overcome the “dead-end roads” in the interview.<BR/>\r\nTo conclude the segment of questions dealing with thematic area 2, complementary\r\nquestions have been designed and may be varied according to the previous flow/content of\r\nthe interview (those that have been answered in the course of the interview will be skipped).\r\nDifficult – structured themes concerning thematic areas 1 and 3 are addressed at the end of\r\nthe interview, for they may require higher level of trust and communication ease, it is\r\nhowever necessary to ensure that this segment of the interview is not conduced under time\r\npressure.\r\n' WHERE `id` = 1