app/controllers/talks_controller.rb

  def index
  	processParams()
  	page = params[:page] || 1
  	DateTime.strptime(params[:call_when_time1_d],'%d.%m.%Y')

  	@timeref = DateTime.new
  	if params[:datsearch] then
  		@timeref = DateTime.strptime(params[:datsearch],'%Y-%m-%d')
  		@timemin = @timeref
  		@timemax = @timeref + 1
  		@conditions = @condition + " and call_when_time >= '#{@timemin}' and call_when_time < '#{@timemax}'"
  		@title = "Výpis hovorů dne: " +   @timeref.strftime("%d.%m.%Y")
  	else
  		@timeref = ""
  		@timemin = ""
  		@timemax = ""
  		if @condition != nil then @conditions = @condition + " "  else @conditions = " " end
  		@title = "Výpis všech hovorů"
  	end
  	#@items = Item.paginate :page => page, :order => "id desc", :conditions => @condition
    @talks = Talk.paginate :page => params[:page], :conditions => @conditions, :joins => [:contact], :order => "call_when_time DESC"
---
SELECT * FROM `talks`