app/controllers/talks_controller.rb

  def show
    @talk = Talk.find(params[:id])
---
SELECT * FROM `talks` WHERE (`talks`.`id` = 1)

  def chngemail
    @talk = Talk.find(params[:id])
---
SELECT * FROM `talks` WHERE (`talks`.`id` = 1)

  def edit
    @talk = Talk.find(params[:id])
---
SELECT * FROM `talks` WHERE (`talks`.`id` = 1)

  def create
    @talk = Talk.new(params[:talk])

    respond_to do |format|
      if @talk.save
---
INSERT INTO `talks` (`poradna`, `created_at`, `call_when_datum`, `poznamka`, `updated_at`, `contact_id`, `poradna_when`, `call_when_time`, `informace_zajem`, `finished`) VALUES(0, '2010-06-14 08:51:29', '2010-06-14', '', '2010-06-14 08:51:29', NULL, '2010-06-14', '2010-06-14 08:51:00', 0, 0)

  def update
    @talk = Talk.find(params[:id])
    if (params[:email] != @talk.contact.email) then
    	Contact.update (@talk.contact_id,	 { :email => params[:email] })
---
SELECT * FROM `talks` WHERE (`talks`.`id` = 3)
UPDATE `talks` SET `updated_at` = '2010-06-14 13:35:08', `finished` = 1, `poradna` = 1, `informace_zajem` = 1, `poradna_when` = '2010-06-20' WHERE `id` = 1

  def destroy
    @talk = Talk.find(params[:id])
    @talk.destroy
---
SELECT * FROM `talks` WHERE (`talks`.`id` = 1)
DELETE FROM `talks` WHERE `id` = 1